hazy1k/STM32-Study-Notes/3.开发板必备资料/模块资料/野火【蓝牙_HC05】模块资料/1-配套参考资料和代码/开发板配套例程/F103拂晓开发板/2.HC05透传控制LED灯/User/usart/bsp_usart_blt.h
#ifndef __BLT_USART_H
#define	__BLT_USART_H


#include "stm32f10x.h"
#include <stdio.h>

#define             BLT_USART_BAUD_RATE                       38400

#define             BLT_USARTx                                USART3
#define             BLT_USART_APBxClock_FUN                 RCC_APB1PeriphClockCmd
#define             BLT_USART_CLK                             RCC_APB1Periph_USART3
#define             BLT_USART_GPIO_APBxClock_FUN            RCC_APB2PeriphClockCmd
#define             BLT_USART_GPIO_CLK                        RCC_APB2Periph_GPIOD
#define             BLT_USART_TX_PORT                         GPIOD  
#define             BLT_USART_TX_PIN                          GPIO_Pin_8
#define             BLT_USART_RX_PORT                         GPIOD
#define             BLT_USART_RX_PIN                          GPIO_Pin_9
#define             BLT_USART_IRQ                             USART3_IRQn
#define             BLT_USART_IRQHandler                      USART3_IRQHandler


#define UART_BUFF_SIZE      1024


typedef struct 
{
  volatile    uint16_t datanum;
  uint8_t     uart_buff[UART_BUFF_SIZE];		
  uint8_t     receive_data_flag;
}ReceiveData;


void BLT_USART_Config(void);
void Usart_SendStr_length( USART_TypeDef * pUSARTx, uint8_t *str,uint32_t strlen );
void Usart_SendString( USART_TypeDef * pUSARTx, uint8_t *str);

char *get_rebuff(uint16_t *len);
void clean_rebuff(void);

#endif /* __USART2_H */
